---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.Dispose
source: html/0420eb3a-f834-32fe-1179-c5c6a357851e.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.Dispose Method

Releases all resources used by the AnalysisDisplayMarkersAndTextSettings

## Syntax (C#)
```csharp
public void Dispose()
```